openfoam_codes/computeACPH/test_case/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
       name    f0;
       type    faceSet;
       action  new;
       source  searchableSurfaceToFace;
       sourceInfo
       {
           // surface searchablePlate;
           // origin  (0.3 0.3 0.3);
           // span (0 0.5 0.5);
	 surface closedTriSurfaceMesh;
	 name "cube.stl";
       }
   }
);

// ************************************************************************* //
